teaching/MAT431/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MAT431 - Partial Differential Equations</title>
<!-- 2017-08-10 Thu 23:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ajit Kumar" />
<link rel="stylesheet" type="text/css" href="/public/coursePages/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/public/coursePages/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MAT431 - Partial Differential Equations</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Course Information</a>
<ul>
<li><a href="#sec-1-1">Overview</a></li>
<li><a href="#sec-1-2">Pedagogy</a></li>
<li><a href="#sec-1-3">References</a></li>
<li><a href="#sec-1-4">Assessment</a></li>
</ul>
</li>
<li><a href="#sec-2">Project 1 : Introduction to PDEs and Matlab pde toolbox</a>
<ul>
<li><a href="#sec-2-1">Definition of a PDE</a></li>
<li><a href="#sec-2-2">Some prominent PDEs and their background</a></li>
<li><a href="#sec-2-3">PDE always needs to be complemented with  boundary conditions</a></li>
<li><a href="#sec-2-4">Matlab pdetoolbox demo through examples</a>
<ul>
<li><a href="#sec-2-4-1">Examples</a></li>
<li><a href="#sec-2-4-2">Project 1: Solve a given PDE with slightly non trivial domain in matlab.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">Project 2: Poisson Equation, Diffusion, and heat equation</a>
<ul>
<li><a href="#sec-3-1">Vector calculus (review)</a>
<ul>
<li><a href="#sec-3-1-1">Gradients</a></li>
<li><a href="#sec-3-1-2">Divergence</a></li>
<li><a href="#sec-3-1-3">Laplacian</a></li>
<li><a href="#sec-3-1-4">Divergence Theorem</a></li>
</ul>
</li>
<li><a href="#sec-3-2">Boundary conditions</a></li>
<li><a href="#sec-3-3">Examples outside maths</a></li>
<li><a href="#sec-3-4">Project: Find two examples of Laplace equation not discussed in class</a></li>
</ul>
</li>
<li><a href="#sec-4">Project 3: PDE of generic transport phenomena</a></li>
<li><a href="#sec-5">Project 4: Structural Mechanics</a></li>
<li><a href="#sec-6">Project 5: Aeronautics, fluid mechanics</a></li>
<li><a href="#sec-7">Project 6-10: New areas using PDEs</a></li>
</ul>
</div>
</div>
<hr  />


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="100%">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">Shiv  Nadar  University</td>
</tr>

<tr>
<td class="left">Instructor</td>
<td class="left">Ajit Kumar</td>
</tr>

<tr>
<td class="left">Office</td>
<td class="left">B122F</td>
</tr>
</tbody>
</table>
<hr  />

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Course Information</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
One primary goal of science is to observe nature and figure out its  basic governing laws. This pursuit of accurate predictions of nature frequently requires us to frame nature laws in mathematical equations. Partial Differential Equations (PDEs) is a special form of equation which has played a prominent role in our current engineering and technological advancement. The focus of this course is to understand how PDEs come out as a natural mathematical tool to study problems like  climate change,  pollution control, aerodynamics, civil engineering, etc. 
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Pedagogy</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The course will be divided into 10 projects. Each project will have following components:
</p>

<ul class="org-ul">
<li>A real life or at least non-mathematical situation from, e.g, image processing, turbine design, climate study, bridge design,  etc.
</li>
<li>Review of necessary physics or any other background information necessary to study this area.
</li>
<li>Derivation of project specific PDEs.
</li>
<li>Use of a software to plot and analyze the solutions of the PDE. (No prior computational experience necessary)
</li>
<li>Report submission on consistency between: underlying problem, PDE, and plotted solutions.
</li>
<li>So what? Imagine another situation where similar PDE fits.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">References</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>An Introduction to Partial Differential Equations with MATLAB, Mathew P. Coleman (Second Edition)
</li>
<li>A collection of Problems in Mathematical Physics, B. M. Budak and A. A. Samarskii
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Assessment</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Based on project reports
</p>


<hr  />
<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Project 1 : Introduction to PDEs and Matlab pde toolbox</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Definition of a PDE</h3>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Some prominent PDEs and their background</h3>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">PDE always needs to be complemented with  boundary conditions</h3>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Matlab pdetoolbox demo through examples</h3>
<div class="outline-text-3" id="text-2-4">
<p>
A toolbox for solving 2d &amp; 3d generic pde using Finite Element Method
</p>
</div>

<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1">Examples</h4>
<div class="outline-text-4" id="text-2-4-1">
</div><ul class="org-ul"><li><a id="sec-2-4-1-1" name="sec-2-4-1-1"></a>Example 1: (Matlab tutorial) Solve Poisson's Equation on a Unit Disk<br  /><ul class="org-ul"><li><a id="sec-2-4-1-1-1" name="sec-2-4-1-1-1"></a>Follow along<br  /></li>

<li><a id="sec-2-4-1-1-2" name="sec-2-4-1-1-2"></a>Review steps<br  /><div class="outline-text-6" id="text-2-4-1-1-2">
<ul class="org-ul">
<li>What was the domain?
</li>
<li>What was the equation?
</li>
<li>What was the boundary condition?
</li>
<li>What it it that you just plotted?
</li>
</ul>
</div>
</li></ul>
</li>




<li><a id="sec-2-4-1-2" name="sec-2-4-1-2"></a>Example 2: Solve the Poisson equation in the unit square<br  /><div class="outline-text-5" id="text-2-4-1-2">
\begin{align*}
\Dt(u) = 0, \qquad \textrm{for }   0 \le x,y, \le 1,
\end{align*}

<p>
with boundary conditions: \(u(y,0) = 0,  u(1,y) = 1 \;\forall y\), and \(\frac{\p u}{\p y}(x,0) = \frac{\p u}{\p y}(x,1) =0 \) for all \(0 \le x \le 1\).
</p>
</div>
</li>


<li><a id="sec-2-4-1-3" name="sec-2-4-1-3"></a>Example 3: (Matlab tutorial) Poisson's Equation with Complex 2-D Geometry<br  /></li>

<li><a id="sec-2-4-1-4" name="sec-2-4-1-4"></a>Example 4: A shell with hot inside ring<br  /></li></ul>
</div>



<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2">Project 1: Solve a given PDE with slightly non trivial domain in matlab.</h4>
<div class="outline-text-4" id="text-2-4-2">
<hr  />
<hr  />
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Project 2: Poisson Equation, Diffusion, and heat equation</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Vector calculus (review)</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">Gradients</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Suppose \(u(x,y,z)\) is a scalar valued function. Gradient of \(u\), denoted by \(\nl(u)\), is defined as
</p>
\begin{align*}
\nl(u) =  \left[\begin{array} {rrrr} \frac{\p u}{\p x} \\  \frac{\p u}{\p y} \\  \frac{\p u}{\p z} \end{array} \right] 
\end{align*}
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">Divergence</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Suppose \(F(x,y,z) = F_1 \mathbf{i} + F_2 \mathbf{j} + F_2 \mathbf{k}\) is a vector valued function. Divergence of \(F\), denoted by \(\text{div}(F)\) of \(\nl \cdot (F)\) is defined as
</p>
\begin{align*}
\textrm{div} (F) = \frac{\p F_1}{\p x} + \frac{\p F_2}{\p y} + \frac{\p F_3}{\p z} 
\end{align*}
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">Laplacian</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Laplacian of a scalar valued function \(u(x,y,z)\), denoted by \(\Dt(u)\), is defined as
</p>

\begin{align*}
\Dt (u) = \textrm{div} (\nl u) = \frac{\p^2 u}{\p x^2} + \frac{\p^2 u}{\p y^2} + \frac{\p^2 u}{\p z^2} 
\end{align*}
</div>
</div>

<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4">Divergence Theorem</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Recall <b>divergence theorem</b> from vector calculus. If \(\vec{F}\) is a vector field, \(V\) is a given volume, \(\p V\) is the the boundary of \(V\), then the flux of \(\vec{F}\) across \(\p V\) is equal to the volume integration of \(\divc(\vec{F})\). 
</p>

\begin{align*}
\int_{\p V} \vec{F} \cdot \hat{n} \, dS = \int_V \divc (\vec{F}) d V 
\end{align*}
</div>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Boundary conditions</h3>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Examples outside maths</h3>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">Project: Find two examples of Laplace equation not discussed in class</h3>
<div class="outline-text-3" id="text-3-4">
<hr  />
<hr  />
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Project 3: PDE of generic transport phenomena</h2>
<div class="outline-text-2" id="text-4">
<hr  />
<hr  />
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Project 4: Structural Mechanics</h2>
<div class="outline-text-2" id="text-5">
<hr  />
<hr  />
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Project 5: Aeronautics, fluid mechanics</h2>
<div class="outline-text-2" id="text-6">
<hr  />
<hr  />
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Project 6-10: New areas using PDEs</h2>
<div class="outline-text-2" id="text-7">
<p>
eg. image processing, climate simulation, cloud and rain formation, cloaking, 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ajit Kumar</p>
<p class="date">Created: 2017-08-10 Thu 23:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
